# ElementIsCutting Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ElementIsCutting Property
ParameterTypeId Class See Also
---
"Solid/Void"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ElementIsCutting { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ElementIsCutting As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ElementIsCutting {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace